2020-10-12_2020-11-2/Trello/app/controllers/tasklists_controller.rb

SELECT "tasklists".* FROM "tasklists"
---
  def index
    @tasklists = Tasklist.all

INSERT INTO "tasklists" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Test"], ["created_at", "2020-11-02 17:31:10.846925"], ["updated_at", "2020-11-02 17:31:10.846925"]]
---
  def create
    @tasklist = Tasklist.new(tasklist_params)

    respond_to do |format|
      if @tasklist.save

DELETE FROM "tasklists" WHERE "tasklists"."id" = $1  [["id", 2]]
---
  def destroy
    @tasklist.destroy

SELECT "tasklists".* FROM "tasklists" WHERE "tasklists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tasklist
      @tasklist = Tasklist.find(params[:id])