2020-10-12_2020-11-2/Trello/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "tasklist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["description", "test"], ["tasklist_id", 1], ["created_at", "2020-11-02 17:31:44.733557"], ["updated_at", "2020-11-02 17:31:44.733557"]]
---
  def create
    @task = @tasklist.tasks.build(task_params)

    respond_to do |format|
      if @task.save

SELECT "tasklists".* FROM "tasklists" WHERE "tasklists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def get_tasklist
      @tasklist = Tasklist.find(params[:tasklist_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."tasklist_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["tasklist_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_task
      @task = @tasklist.tasks.find(params[:id])